app/Controllers/CalendarioController.php

SELECT *
FROM `calendario`
---
    public function getEvents()
    {
        $events = $this->calendarioModel->findAll();