app/Controllers/Dashboard.php

    public function getTasks()
    {
        $session = session();
        $userId = $session->get('id_usuario'); // Obtener el id_usuario de la sesión

        // Filtrar las tareas por el id_usuario
        $tasks = $this->tareasModel->where('id_usuario', $userId)->findAll();
---
SELECT *
FROM `tareas`
WHERE `id_usuario` = '19'

    public function getNotes()
    {
        $session = session();
        $userId = $session->get('id_usuario'); // Obtener el id_usuario de la sesión

        // Filtrar las notas por el id_usuario
        $notes = $this->notasModel->where('id_usuario', $userId)->findAll();
---
SELECT *
FROM `notas`
WHERE `id_usuario` = '19'