app/Controllers/TareasController.php

    public function index()
    {
        $session = session();
        if (!$session->has('isLoggedIn')) {
            return redirect()->to('/auth/login')->with('error', 'Por favor, inicia sesión primero.');
        }
        $data['title'] = "HAZ RTVE | Tareas";
        $data['page_title'] = "Tareas";
        $data['tasks'] = $this->TareasModel->findAll();
---
SELECT *
FROM `tareas`