app/Controllers/TareasController.php

    public function index()
    {
        $session = session();
        if (!$session->has('isLoggedIn')) {
            return redirect()->to('/auth/login')->with('error', 'Por favor, inicia sesión primero.');
        }

        $id_usuario = $session->get('id_usuario');
        $data['title'] = "HAZ RTVE | Tareas";
        $data['page_title'] = "Tareas";
        $data['tasks'] = $this->TareasModel->where('id_usuario', $id_usuario)->findAll();
---
SELECT *
FROM `tareas`
WHERE `id_usuario` = '1'

    public function updateState()
    {
        $session = session();
        $id_usuario = $session->get('id_usuario');
        $id = $this->request->getPost('id_tarea');

        // Verify that the task belongs to the logged in user
        $task = $this->TareasModel->where('id_usuario', $id_usuario)->find($id);
---
SELECT *
FROM `tareas`
WHERE `id_usuario` = '1'
AND `tareas`.`id_tarea` = '38'