app/Controllers/UsersController.php

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id_usuario` = '1'
---
    public function getUser()
    {
        $session = session();
        if (!$session->has('isLoggedIn')) {
            return redirect()->to('/auth/login')->with('error', 'Por favor, inicia sesión primero.');
        }

        $id_usuario = $session->get('id_usuario');
        $user = $this->userModel->find($id_usuario);