app/Models/CalendarioModel.php

    public function findEventsByUser($userId)
    {
        return $this->where('id_usuario', $userId)->findAll();
---
SELECT *
FROM `calendario`
WHERE `id_usuario` = '1'