app/Models/TareasModel.php

SELECT *
FROM `tareas`
---
    public function getAllTasks()
    {
        return $this->findAll();

UPDATE `tareas` SET `estado` = '0', `updated_at` = '2024-06-14 10:10:28'
WHERE `tareas`.`id_tarea` IN ('38')
---
    public function updateTask($id, $data)
    {
        log_message('info', 'Datos recibidos para actualizar tarea: ' . json_encode($data));

        try {
            if ($this->update($id, $data)) {