app/Models/TareasModel.php

    public function getTareaById($id_tarea)
    {
        $builder = $this->table($this->table); // Utiliza el método table() de CI4
        $builder->select('*'); // Selecciona todas las columnas
        $builder->where('id_tarea', $id_tarea); // Añade la condición where
        $query = $builder->get();
---
SELECT *
FROM `tareas`
WHERE `id_tarea` = 1